import 'package:get/get.dart';

class HelpController extends GetxController {
 /* late List<HelpModel> helps;

  @override
  void onInit() {
    super.onInit();
    helps = gethelps();
  }

  List<HelpModel> gethelps() {
    return [
      HelpModel(
        title: 'عيادة الهضمية',
        body: '''
تشخيص ومعالجة أمراض الجهاز الهضمي بالتنظير والايكو والاشعة والفحص السريري
تنظير هضمي علوي وسفلي:
التنظير هو اجراء غير جراحي يستخدم لفحص الجهاز الهضمي  عبر منظار داخلي وهو انبوب مرن مع ضوء وكاميرا ملحقة به..لعرض صور الجهاز الهضمي على شاشة  
التنظير العلوي:يتم فيه تمرير المنظار عبر الفم والحلق الى المري مما يسمح للطبيب بمشاهدة المري والمعدة والجزء العلوي من الامعاء الدقيقة المسمى بالاثني عشر
التنظير السفلي: تمرير المنظار الى الامعاء الغليظة عبر المستقيم لفحص هذه المنطقة من الامعاء
علاج ارتجاع المريء، وأمراض الجهاز الهضمي ومتلازمة القولون العصبي وغير ذلك الكثير
عندما تصادف مشكلة صحية تتعلق ببطنك أو أمعائك، وكذلك عندما تشعر بعدم الراحة بعد تناول أي وجبة أو أطعمة معينة، فإن طبيب الجهاز الهضمي هو من يستطيع مساعدتك في تشخيص سبب المشكلة قبل أن تتفاقم، وبالتالي توفير العلاج المناسب.

''',
        isExpanded: false.obs,
      ),
      HelpModel(
        title: 'عيادة  ( امراض الغدد والداء السكري)',
        body: '''
مرض السكري هو مرض يصيب جهاز الغدد الصماء - الغدد المختلفة التي تفرز الهرمونات التي تتحكم في النمو والتكاثر وتنظم عمل كل عضو في الجسم. يحدث مرض السكري عندما لا ينتج البنكرياس كمية كافية من الأنسولين ، أو تصبح الخلايا "مقاومة للأنسولين" وغير قادرة على تحويل الكربوهيدرات (السكريات) إلى وقود قابل للاستخدام..
-	معالجة أمراض الغدد الصم والأمراض الداخلية 
لأمراض الغدد الصم أعراض منتشرة..قد تؤثر على أجزاء متعددة من الجسم .كما يمكن أن تتراوح في شدتها من خفيفة الى شديد..تعتمد العلاجات على الاضطراب المحدد
-	الداء السكري:
يشير الداء السكري الى مجموعة من الأمراض التي تؤثر على كيفية استخدام الجسم لسكر الدم (الغلوكوز) .حيث ان الغلوكوز مهم للصحة لانة مصدر مهم  لطاقة الخلايا التي تتكون منها العضلات والأنسجة.
يختلف السبب الرئيسي لداء السكري من حالة الى اخرى
-	-اضطرابات النمو والبلوغ:
يعتبر البلوغ مرحلة حساسة للغاية حيث يحدث للطفل الكثير من التطورات البدنية والعقلية..والبلوغ هو عبارة عن عملية تؤدي الى النضج الجسدي والجنسي وكذلك النمو والتغيرات في تكوين جسم الطفل..اضطرابات مرحلة البلوغ تؤثر بشكل كبير على كل من الصحة الجسدية والنفسية..لذلك يجب مراقبة  كل من يعاني من اضطرابات البلوغ في سياق التدخل في الوقت المناسب
-	-أمراض العقم
يُعرف العقم بعدم القدرة على الحمل بشكل طبيعي..
تعد مشكلة العقم من المشكلات الصحية الشائعة وتنسب ثلث حالات العقم تقريبا الى مشكلات صحية لدى المرأة ..وثلثها الى مشكلات صحية يعاني منها الرجل والثلث الأخير ينُسب الى اضطرابات لدى كلا الزوجين او الى اسباب مجهولة
لذلك يجب الحرص على مراجعة الطبيب في حال عدم القدرة على الحمل رغم المحاولات المتعددة خلال سنة كاملة للكشف عن وجود مشكلة صحية وعلاجها
-	-أمراض الغدد الدرقية والنخامية
عقم
الغدة النخامية هي الغدة الرئيسية حيث أن الهرمونات التي تنتجها تتحكم في العديد من العمليات المختلفة في الجسم وتنظم وظيفة العديد من الاعضاء..لذللك الأعراض التى تحدث عندما تتوقف الغدة عن العمل بشكل صحيح تكون مختلفة من حالة الى أخرى
-	-أمراض البدانة والشعرانية
-	الشعرانية هي عبارة عن مشكلة صحية تعاني منها بعض النساء. تتمثل بنمو شعر غير مرغوب به. له نمط الشعر الذكوري الكثيف. تنتج الشعرانية عن وجود خلل في نسبة الهرمونات وفرط إنتاج الهرمونات الذكري الأندورجينات خاصةً التستوسترون.
-	هناك عدة خيارات علاجية يمكن الاعتماد عليها لمعالجة مشكلة الشعرانية لدى المرأة
-	البدانة: هي اضطراب معقد يتسبب في وجود كمية زائدة من دهون الجسم. وليست البدانة مجرد قلق حيال الشكل الخارجي. حيث أنها تؤدي الى زيادة خطر الاصابة بالأمراض والمشاكل الصحية مثل أمراض القلب ومرض السكري وارتفاع ضغط الدم.


''',
        isExpanded: false.obs,
      ),
      HelpModel(
        title: 'عيادة الامراض الصدرية و التنفسية',
        body: '''
تشير أمراض الصدر إلى الاضطرابات التي تؤثر على الرئتين، والأعضاء التي تسمح لك بالتنفس، فقد تمنعك مشاكل التنفس الناتجة عن أمراض الرئة من الحصول على كمية كافية من الأكسجين، وتسبب لك ألمًا في الصدر.
تشخيص ومعالجة أمراض الجهاز التنفسي-معالجة الربو والأمراض التحسسية-اختبار وظائف الرئة-خزعات عبر جدار الصدر
. أمراض الصدرية
تعتبر من أكثر الأمراض المزمنة خطورة على مستوى العالم  وهي  نتيجة لأسباب خاطئة تُعرض الجهاز التنفسي والصدري للاضطرابات كالتدخين أو الهواء الملوث او العدوى البكتيرية واحيانا يرجع الى عامل ورائي فتؤثر هذه الأسباب على الجهاز التنفسي والرئتين فتنتُج الأمراض الصدرية كالربة والتهاب القصبات والأزمة الصدرية وغيرها من الأمراض المزمنة
ب. أمراض أنسجة الرئة
 تؤثر هذه الأمراض على بنية أنسجة الرئة، مما يتسبب في إصابتها بالندب أو الالتهاب، الأمر الذي يجعل الرئتين غير قادرتين على التمدد بالكامل، ويصعب عليهما استيعاب الأكسجين وإطلاق ثاني أكسيد الكربون، ويضغط على الصدر.

''',
        isExpanded: false.obs,
      ),
      HelpModel(
        title: 'معالجة اثار حب الشباب والندبات',
        body: '''
يعاني الكثير من النّاس على مختلف الجنسين من ظهور مشكلة حب الشّباب، وهي تُعتبر مشكلة مزعجة ومؤلمة في بعض الأحيان، خاصةً إذا تركت وراءها حُفراً أو آثاراً مزعجة ومشوهه، وتحدث حبوب الشّباب عندما يصبح هناك إفراز فائض للزيوت على البشرة، بالإضافة إلى تراكم خلايا الجلد الميتة والبكتيريا، ممّا يُسبب انسداد المسام وانتفاخها
''',
        isExpanded: false.obs,
      ),
    ];
  }*/
}
