import 'package:alwadi_medical_center/src/constents/images_string.dart';
import 'package:alwadi_medical_center/src/screens/model/majors_model.dart';
import 'package:get/get.dart';

class OurSectionsController extends GetxController {
  late List<MajorModel> majors;

  @override
  void onInit() {
    super.onInit();
    majors = getmajors();
  }

  List<MajorModel> getmajors() {
    return [
      MajorModel(
        title: 'عيادة الهضمية',
        body: '''
تشخيص ومعالجة أمراض الجهاز الهضمي بالتنظير والايكو والاشعة والفحص السريري
تنظير هضمي علوي وسفلي:
التنظير هو اجراء غير جراحي يستخدم لفحص الجهاز الهضمي  عبر منظار داخلي وهو انبوب مرن مع ضوء وكاميرا ملحقة به..لعرض صور الجهاز الهضمي على شاشة  
التنظير العلوي:يتم فيه تمرير المنظار عبر الفم والحلق الى المري مما يسمح للطبيب بمشاهدة المري والمعدة والجزء العلوي من الامعاء الدقيقة المسمى بالاثني عشر
التنظير السفلي: تمرير المنظار الى الامعاء الغليظة عبر المستقيم لفحص هذه المنطقة من الامعاء
علاج ارتجاع المريء، وأمراض الجهاز الهضمي ومتلازمة القولون العصبي وغير ذلك الكثير
عندما تصادف مشكلة صحية تتعلق ببطنك أو أمعائك، وكذلك عندما تشعر بعدم الراحة بعد تناول أي وجبة أو أطعمة معينة، فإن طبيب الجهاز الهضمي هو من يستطيع مساعدتك في تشخيص سبب المشكلة قبل أن تتفاقم، وبالتالي توفير العلاج المناسب.

''',
        isExpanded: false.obs,
        image: mPost3Img,
        isBgPink: false,
      ),
      MajorModel(
        title: 'عيادة  ( امراض الغدد والداء السكري)',
        body: '''
مرض السكري هو مرض يصيب جهاز الغدد الصماء - الغدد المختلفة التي تفرز الهرمونات التي تتحكم في النمو والتكاثر وتنظم عمل كل عضو في الجسم. يحدث مرض السكري عندما لا ينتج البنكرياس كمية كافية من الأنسولين ، أو تصبح الخلايا "مقاومة للأنسولين" وغير قادرة على تحويل الكربوهيدرات (السكريات) إلى وقود قابل للاستخدام..
-	معالجة أمراض الغدد الصم والأمراض الداخلية 
لأمراض الغدد الصم أعراض منتشرة..قد تؤثر على أجزاء متعددة من الجسم .كما يمكن أن تتراوح في شدتها من خفيفة الى شديد..تعتمد العلاجات على الاضطراب المحدد
-	الداء السكري:
يشير الداء السكري الى مجموعة من الأمراض التي تؤثر على كيفية استخدام الجسم لسكر الدم (الغلوكوز) .حيث ان الغلوكوز مهم للصحة لانة مصدر مهم  لطاقة الخلايا التي تتكون منها العضلات والأنسجة.
يختلف السبب الرئيسي لداء السكري من حالة الى اخرى
-	-اضطرابات النمو والبلوغ:
يعتبر البلوغ مرحلة حساسة للغاية حيث يحدث للطفل الكثير من التطورات البدنية والعقلية..والبلوغ هو عبارة عن عملية تؤدي الى النضج الجسدي والجنسي وكذلك النمو والتغيرات في تكوين جسم الطفل..اضطرابات مرحلة البلوغ تؤثر بشكل كبير على كل من الصحة الجسدية والنفسية..لذلك يجب مراقبة  كل من يعاني من اضطرابات البلوغ في سياق التدخل في الوقت المناسب
-	-أمراض العقم
يُعرف العقم بعدم القدرة على الحمل بشكل طبيعي..
تعد مشكلة العقم من المشكلات الصحية الشائعة وتنسب ثلث حالات العقم تقريبا الى مشكلات صحية لدى المرأة ..وثلثها الى مشكلات صحية يعاني منها الرجل والثلث الأخير ينُسب الى اضطرابات لدى كلا الزوجين او الى اسباب مجهولة
لذلك يجب الحرص على مراجعة الطبيب في حال عدم القدرة على الحمل رغم المحاولات المتعددة خلال سنة كاملة للكشف عن وجود مشكلة صحية وعلاجها
-	-أمراض الغدد الدرقية والنخامية
عقم
الغدة النخامية هي الغدة الرئيسية حيث أن الهرمونات التي تنتجها تتحكم في العديد من العمليات المختلفة في الجسم وتنظم وظيفة العديد من الاعضاء..لذللك الأعراض التى تحدث عندما تتوقف الغدة عن العمل بشكل صحيح تكون مختلفة من حالة الى أخرى
-	-أمراض البدانة والشعرانية
-	الشعرانية هي عبارة عن مشكلة صحية تعاني منها بعض النساء. تتمثل بنمو شعر غير مرغوب به. له نمط الشعر الذكوري الكثيف. تنتج الشعرانية عن وجود خلل في نسبة الهرمونات وفرط إنتاج الهرمونات الذكري الأندورجينات خاصةً التستوسترون.
-	هناك عدة خيارات علاجية يمكن الاعتماد عليها لمعالجة مشكلة الشعرانية لدى المرأة
-	البدانة: هي اضطراب معقد يتسبب في وجود كمية زائدة من دهون الجسم. وليست البدانة مجرد قلق حيال الشكل الخارجي. حيث أنها تؤدي الى زيادة خطر الاصابة بالأمراض والمشاكل الصحية مثل أمراض القلب ومرض السكري وارتفاع ضغط الدم.


''',
        isExpanded: false.obs,
        image: mPost2Img,
        isBgPink: false,
      ),
      MajorModel(
        title: 'عيادة الامراض الصدرية و التنفسية',
        body: '''
تشير أمراض الصدر إلى الاضطرابات التي تؤثر على الرئتين، والأعضاء التي تسمح لك بالتنفس، فقد تمنعك مشاكل التنفس الناتجة عن أمراض الرئة من الحصول على كمية كافية من الأكسجين، وتسبب لك ألمًا في الصدر.
تشخيص ومعالجة أمراض الجهاز التنفسي-معالجة الربو والأمراض التحسسية-اختبار وظائف الرئة-خزعات عبر جدار الصدر
. أمراض الصدرية
تعتبر من أكثر الأمراض المزمنة خطورة على مستوى العالم  وهي  نتيجة لأسباب خاطئة تُعرض الجهاز التنفسي والصدري للاضطرابات كالتدخين أو الهواء الملوث او العدوى البكتيرية واحيانا يرجع الى عامل ورائي فتؤثر هذه الأسباب على الجهاز التنفسي والرئتين فتنتُج الأمراض الصدرية كالربة والتهاب القصبات والأزمة الصدرية وغيرها من الأمراض المزمنة
ب. أمراض أنسجة الرئة
 تؤثر هذه الأمراض على بنية أنسجة الرئة، مما يتسبب في إصابتها بالندب أو الالتهاب، الأمر الذي يجعل الرئتين غير قادرتين على التمدد بالكامل، ويصعب عليهما استيعاب الأكسجين وإطلاق ثاني أكسيد الكربون، ويضغط على الصدر.

''',
        isExpanded: false.obs,
        image: mPost1Img,
        isBgPink: false,
      ),
      MajorModel(
        title: 'معالجة اثار حب الشباب والندبات',
        body: '''
يعاني الكثير من النّاس على مختلف الجنسين من ظهور مشكلة حب الشّباب، وهي تُعتبر مشكلة مزعجة ومؤلمة في بعض الأحيان، خاصةً إذا تركت وراءها حُفراً أو آثاراً مزعجة ومشوهه، وتحدث حبوب الشّباب عندما يصبح هناك إفراز فائض للزيوت على البشرة، بالإضافة إلى تراكم خلايا الجلد الميتة والبكتيريا، ممّا يُسبب انسداد المسام وانتفاخها
''',
        isExpanded: false.obs,
        image: bPost1Img,
        isBgPink: true,
      ),
      MajorModel(
        title: 'عيادة أمراض القلب والأوعية ',
        body: '''
معالجة الامراض الداخلية (أمراض القلب -ارتفاع شحوم الدم – ارتفاع التوتر الشرياني –أمراض الأوعية والدوران الدموي ) .
ايكو دوبللر قلبي ملون
أ -  ارتفاع التوتر الشرياني
ارتفاع التوتر الشرياني أو ما يعرف بين الناس بارتفاع الضغط، هو أحد الأمراض المزمنة الشائعة بين الناس سواء في البلاد المتقدمة أو غير المتقدمة، إذ إنه يصيب أكثر من مليار ونصف المليار شخص على مستوى العالم حاليًا، وقد حددت منظمة الصحة العالمية ضغط الدم المرتفع بأنه السبب الرئيس للوفيات المتعلقة بالقلب والأوعية الدموية، كما أقرت الرابطة العالمية لارتفاع ضغط الدم (WHL)، وهي منظمة تضم تحت لوائها 85 جمعية ورابطة وطنية لفرط ضغط الدم، أن أكثر من 50% من الأشخاص الذين يعانون من ارتفاع ضغط الدم حول العالم لا يدركون أنهم مصابون به، وهذا يؤدي إلى حدوث مضاعفات خطيرة للمرض، ولذلك فإنه يسمى بالقاتل الصامت.
ب -  ارتفاع شحوم الدم 
لا يُصاحب ارتفاع الكوليسترول (بالإنجليزية: cholesterol) في الدم عادةً أية أعراض، إذ قد تظهر الأعراض عند تسبب ارتفاع الكولسترول بأذىً ملحوظ، وتجدر الإشارة إلى أن الأعراض تظهر على هيئة أمراض القلب كالذبحة الصدرية (بالإنجليزية: Angina)، التعب العام، أو الغثيان، وقد يتسبب ارتفاع الكولسترول بالإصابة بالجلطة الدماغية (بالإنجليزية: Stroke) أو النوبة القلبية (بالإنجليزية: Heart Attack)عند فقدان السيطرة على مستوى الكولسترول في الدم.[١] أمّا بالحديث عن الشحوم الثلاثية (بالإنجليزية: Triglycerides) فلا تظهر أي أعراض عند ارتفاعها، إلا إذا كان ارتفاعها نتيجة خلل جيني، إذ تتراكم كتل دهنية تحت الجلد فيما يُعرف بالورم الأصفر (بالإنجليزية: Xanthoma).[٢]
ج_ قصور القلب
قصور القلب، أو ما يعرف بفشل القلب، هو عبارة عن مرض يصيب الشخص عندما يصبح قلبه عاجزاً عن ضخ الدم بقوة كافية تجعله يصل إلى كافة أجزاء الجسم كما هو معتاد.

وهنا تصل كميات أقل من الدم النظيف إلى أعضاء الجسم المختلفة، ما يسبب تراكم السوائل في الأعضاء، مثل الرئتين والقدمين والبطن ويصاب المرسض بوذمة موضعية او متعممة.
كل هذا يؤدي إلى شعور المصاب بقصور القلب بتعب وضعف دائمين وصعوبة في ممارسة الأنشطة اليومية الطبيعية.
ح- الاحتشاء
 حالة احتشاء عضلة القلب هي عبارة عن حالة تنشأ عندما يصاب أحد الشرايين التاجية بانسداد كامل ومفاجئ أو عندما يتباطأ تدفق الدم في هذه الشرايين بشكل ملحوظ.
وقد يحصل الانسداد أو التباطؤ المذكورين نتيجة عدة عوامل وأمور، مثل: تكون خثرة دموية في هذه الشرايين أو تضيق الشرايين من الداخل بسبب الإصابة بتصلب الشرايين.
ونظرًا لأن الشرايين المحيطية تعمل بشكل رئيسي على تغذية عضلة القلب، فإن أي تضيق أو انسداد فيها قد يعيق عمل منطقة معينة أو عدة مناطق من عضلات القلب، مما قد يؤدي لخفض قدرة القلب على ضخ الدم كالمعتاد، الأمر الذي يؤدي بطبيعة الحال لمضاعفات خطيرة وتلف قد يكون دائمًا في عضلات القلب.

''',
        isExpanded: false.obs,
        image: mPost4Img,
        isBgPink: false,
      ),
      MajorModel(
        title: 'ازالة الشعر بالليزر',
        body: '''
أًصبح استخدام الليزر للأغراض الطبية والتجميلية شائعاً خلال السنوات الأخيرة، فمع نتائجه الفعّالة والمضمونة، زاد الإقبال عليه من قبل الكثير من الأشخاص على مستوى العالم. إزالة الشعر بالليزر هي واحدة من الاجراءات التجميلية التي يفضلها الكثير من النساء والرجال كبديل مثالي للطرق التقليدية المستخدمة منذ القدم. فلا يعمل فقط على إزالة الشعر من الجذور، بل يمنحنا نتائج دائمة تحول دون نمو بصيلات الشعر مرة آخرى.
''',
        isExpanded: false.obs,
        image: bPost4Img,
        isBgPink: true,
      ),
      MajorModel(
        title: 'عيادة أمراض الأذن و الأنف و الحنجرة ',
        body: '''
تخطيط السمع الهوائي والعظمي الكهربائي-معاوقة سمعية -تنظير حنجرة-تشخيص ومعالجة الدوار-معالجة أمراض الأنف التحسسية ( التهاب اللوزات والجيوب ) .
تكفل قسم  طب الأذن و الأنف و الحنجرة و جراحة بعض مناطق الوجه و الرقبة  بالتشخيص و المعالجة الطبية أو الجراحية لأمراض و إصابات الأذن و الأنف و التجاويف الأنفية و الحنجرة و الحلق و الوجه و الرقبة و أمراض  و الأمراض التي تندمج ضمن اختصاص الطب العصبي و طب الأذن و الأنف و الحنجرة
وتشمل خدمات التشخيص والعلاج للأمراض والحالات المتعلقة بأذن أنف وحنجرة الآتية :

( إضطرابات الأذن والسمع بما في ذلك إلتهاب الأذن وألم في الأذن وضغط في الأذن ومشكلة السمع وطنين الأذن والدوخة.
• جوف الفم و عنق و إضطرابات الحنجرة مثل إلتهاب اللوزتين وإلتهاب البلعوم وكحة مزمنة وإضطراب الصوت وإختلال وظيفة الغدة.
وإلتهاب الأنف بما في ذلك إلتهاب مزمن في غشاء الأنف والحساسية وإضطرابات حاسة الشم.
سرطان وأورام في أذن أنف وحنجرة- الشخير وانقطاع النفس النومي - فحص أذن أنف وحنجرة
فحص مجهري - جراحة أذن أنف وحنجرة الكبيرة والصغيرة - جراحة سرطان في الرأس والعنق
جراحة الأذن الوسطى - جراحة الجيوب الأنفية بالمنظار- جراحة الغدة بالمنظار- فحص الأذن الداخلي 
ونظام الأعصاب - فحص الحنجرة وتقييم إضطرابات الكلام - منظار أذن أنف وحنجرة - فحص حاسة الشم
علاج النطق - فحص حاسة السمع - فحص التوازن - مساعدة السمع - ممارسة التوازن بطريق
 Posturography - تقييم و تشخيص إضطرابات النوم )

''',
        isExpanded: false.obs,
        image: mPost6Img,
        isBgPink: false,
      ),
      MajorModel(
        title: 'عيادة الجراحة التجميلية ',
        body: '''
جراحة لتشوهات (الوجه أو الاذنيين أو الانف أو الأجفان ) وجميع عمليات شفط الدهون وحقنها وكل انواع الحقن من بوتكس وفيللر وميزوثيرابي .
وازالة الزوائد اللحمية والدهنية والثآليل ....... الخ .
أ‌-	شد ترهلات الأجفان :
الجفن يتأثر كثيرا بالعوامل الخارجية المحيطة به و بعامل الزمن بشكل كبير, فعند التقدم بالسن يحدث ترهل لجلد الوجه عامة و ضعف للعضلات و حدوث ترسبات دهنية تؤدي لحدوث مشاكل بالجفون. و تعمل الجراحة تجميل العيون و الجفون لأزالة تلك المشاكل لتعيد الشكل الشبابي و النضارة للعين.
و بالإمكان إجراء تلك الجراحة وحدها او كجزء من عملية شد الوجه و الأجفان . و يمكن إجراءها على مرحلة واحدة أي الأجفان العليا و السفلى معا في ان واحد او يتم على مرحلتين حسب رغبة المريض و اجتهاد الطبيب
ب‌-	حقن الدهون :
 تعّرف عملية حقن الدهون الذاتية على أنها تقنية طبية تجميلية – غير جراحية – تهدف الى تعويض الخلايا الدهنية التالفة والدهون المفقودة في مناطق مختلفة من الجسم وذلك من خلال استخلاص الدهون من المناطق التي تتجمع بها بصورة كبيرة ومن ثم اعادة حقنها وتوزيعها في المناطق المطلوبة . وعادةً ما يؤدي اضمحلال الطبقة الدهنية الموجودة تحت الجلد الى ظهور التجاعيد والخطوط الرقيقة المعبّرة عن التقدم بالعمر، لذلك فإن تعويض هذا الفقد يساهم في استعادة نضارة البشرة وشبابها .
ج- حقن البلازما :
تُستخدم البلازما الغنية بالصفائح الدموية في حقن الوجه وهي تقوم بعدة أدوارٍ داخل البشرة ما إن يتم حقنها تحتها، فتأتي فوائد البلازما للوجه من الصفائح الدموية التي تُعتبر وظيفتها الأساسية هي العلاج وتحفيز الأنسجة المتضررة على العلاج وإنتاج خلايا جديدة، بينما تحتوي البلازما على البروتينات والفيتامينات والمعادن المختلفة وتقوم على تحفيز البشرة وما تحتها لإنتاج الكولاجين وتساعد البشرة وتحفزها على العودة لحالتها الأولى واستعادة نضارتها وملمسها وملء التجاويف التي سببتها التجاعيد فيها فيقل ظهورها وتأثيرها على الشكل العام للبشرة
ح- معالجة الحروق والتشوهات الولادية:
الحروق تلفٌ يحدث للأنسجة بسبب تعرضها لحرارة حارقة أو لحرارة الشمس لفترة طويلة أو لأي إشعاعٍ آخر أو لمادةٍ كيميائيةٍ أو لتيارٍ كهربائيٍّ. ويمكن أن تكون الحروق طفيفةً أو خطرةً مهددةً للحياة.
ويتوقف علاج الحروق على موضع الحرق ودرجته. يمكن علاج حروق الشمس والحروق البسيطة عادةً في المنزل. بينما تحتاج الحروق العميقة والحروق واسعة الانتشار إلى عناية طبية فورية. وقد يحتاج بعض المصابين إلى تلقي العلاج في مراكز علاج متخصصة لعلاج الحروق ومتابعة طبية تستغرق شهورًا..
خ- التشوهات الولادية : 
تعرف العيوب الخلقية على أنها ولادة طفل به بعض التشوهات بزيادة أو نقصان غير طبيعي في عضو من أعضاء الجسم، وذلك نتيجة لخلل جيني أثناء المراحل الأولى لتطور الخلية التكوينية سببه تعرض الخلية لبعض العوامل الشاذة عن طبيعة تطور الجنين، وتكون بعض هذه التشوهات بسيطة لا تؤثر على حياة الطفل، لكن بعضها حاد قد يؤدي إلى الوفاة.
جهاز liposuction شفط دهون
-	وداعا لمناطق تراكم الدهون المزعجة مع احدث تقنيات الفايبر لشفط الدهون ونحت الجسام ممن خلال جهاز vibration liposuction
-	والذي يعمل على تكسير الغدد الدهنيه بحيث لا تعود الدهون لنفس المنطقه
-	يتم هذا الإجراء بالتخدير الموضعي داخل العياده حيث يمكن مباشرة العودة للحياة الطبيعية دون الحاجه لفتره نقاهة

''',
        isExpanded: false.obs,
        image: mPost5Img,
        isBgPink: true,
      ),
      MajorModel(
        title: 'توحيد لون البشرة',
        body: '''
تتعرض البشرة للعديد من العوامل التي تجعلها تصاب بالبقع. فتلاحظ السيدة ان هناك مناطق داكنة اكثر من غيرها، بعضها مائل الى السواد وبعضها محمر... مهما كان لون البشرة فلا شك ان النتيجة مزعجة وقد تسبّب الاحراج. ومعلوم ان هناك العديد من العوامل التي تلعب دورا في التبقع، منها ما له علاقة بالتعرض لأشعة الشمس من دون استخدام كريم وقاية من الشمس، ومنها ما له علاقة بعدم اتباع نظام غذائي صحي ومنها ما له علاقة بالحمل.
''',
        isExpanded: false.obs,
        image: bPost2Img,
        isBgPink: true,
      ),
      MajorModel(
        title: 'عيادة الأمراض البولية و التناسلية ومعالجة العقم ',
        body: '''
يضم طاقم قسم طب المسالك البولية أطباء متخصصون في أمراض المسالك البولية وذوي كفاءة عالية، علم أمراض المسالك البولية هو تخصص في الطب يدرس ويعالج عداوى المسالك البولية عند الرجال والنساء وكذلك الأمراض التناسلية عند الرجال.
علاج العقم والضعف الجنسي عند الرجال - علاج حصيات الجهاز البولي -علاج كافة التشوهات البولية والتناسلية عند الأطفال -علاج السلس البولي عند الاطفال - علاج السلس البولي عند النساء بالطرق المحافظة - علاج تشوهات الجهاز البولي التناسلي عند الكبار -علاج أمراض البروستات
معالجة أمراض الكلية عند الكبار- متابعة حالات زرع الكلية - معالجة قصور الكلية الحاد والمزمنة -معالجة اضطرابات الشوارد في الدم - الزلال في البول -اعتلالات الكلية بالأمراض الجهازية- معالجة ارتفاع ضغط الدم الأولي والثانوي
الحالات التى يتم علاجها:
-	تشخيص وعلاج كافة أمراض المسالك البولية.
-	مشكلات المسالك البولية عند الأطفال.
-	التهابات و أمراض البروستاتا.
-	حصوات الكلى والمسالك البولية.
-	آلام الجنب والخصر وأسفل البطن.
-	جراحات المناظير البولية والبطنية المتقدمة.
-	التهابات المثانة والحرقان وصعوبات التبول.
-	سلس البول اللا إرادي.
-	أورام الكلى والمثانة والبروستاتا والغدة الكظرية.
-	حالات وجود الدم في البول.
-	الكشف المبكر وعلاج أورام المسالك البولية والتناسلية.
-	علاج عقم الرجال.
-	عمليات الدوالي .
-	معالجة الضعف الجنسي وقلة الرغبة والقذف السريع.
-	آلام وأورام وأمراض الخصيتين.

''',
        isExpanded: false.obs,
        image: mPost9Img,
        isBgPink: false,
      ),
      MajorModel(
        title: 'تنظيف البشرة ونضارتها.',
        body: '''
نضارة البشرة هدفٌ تسعى إليه أغلب النّساء بوجه عام، لكن هناك عدّة عوامل تحول دون ذلك، مثل التّوتر، والتّقدم في السّن، والنّوم غير الكافي، والحرارة، والهرمونات، والبثور، والتّجاعيد. وهناك العديد من الطّرق التي يمكن اتّباعها للحصول على البشرة النّضرة، وكذلك وكذلك لا بدّ من استخدام بعض أقنعة التّقشير والنضارة الطّبيعية للوصول إلى بشرةٍ نضرة خالية من العيوب.
''',
        isExpanded: false.obs,
        image: bPost6Img,
        isBgPink: true,
      ),
      MajorModel(
        title: 'تقشير كربوني ',
        body: '''
ظهرت تقنية التقشير الكربوني كواحدة من أحدث علاجات الليزر للبشرة في الآونة الأخيرة، وقد اكتسبت هذه التقنية سمعة جيدة جداً جعلتها من الأفضل بين علاجات الليزر المختلفة، يتم استخدام تقنية التقشير الكربوني للبشرة لحل العديد من مشاكل الجلد وعلى رأسها التباين في لون البشرة (التصبغ،) والمسام الواسعة، وتدهن البشرة، يُمكن استخدام تقنية التقشير الكربوني لأنواع البشرة المختلفة بأمان كامل، ويتم إجرائها في معظم عيادات التجميل بسهولة عند توفر الجهاز الخاص بها
''',
        isExpanded: false.obs,
        image: bPost5Img,
        isBgPink: true,
      ),
      MajorModel(
        title: 'حقن البوتوكس',
        body: '''
يهدف حقن البوتوكس الى منع تقلص عضلات التعبيرية بالوجه والتي تسبب ظهور التجاعيد مع التقدم في السن, من أجل التقليل من علامات شيخوخة الجلد. يتم القيام بهذا الإجراء لأغراض جمالية. غالباً لدى النساء اللواتي يرغبن بمظهر أكثر شباباً.
مع شيخوخة الجلد, تظهر تجاعيد في الجلد فوق الخدود, في منطقة الجبين الأمامية, في منطقة الرقبة وخط الفك السفلي, وجانبي العينين. يعود السبب الى تعرض أنسجة الكولاجين والمرونة السليمة للجلد للضرر على مّر السنين. بالإضافة الى ذلك, فإن تعرض الجلد لأشعة الشمس يؤدي الى حدوث ضرر متراكم لأنسجة الجلد.
''',
        isExpanded: false.obs,
        image: bPost3Img,
        isBgPink: true,
      ),
      MajorModel(
        title: 'عيادة الجراحة العامة ',
        body: '''
معاينة وتشخيص الأمراض التي تحتاج الى الجراحة-متابعة الجروح والضمادات-معالجة آفات جهاز الهضم الجراحية -معالجة النواسير العصعصية- معالجة البواسير والشقوق والنواسير الشرجية-معالجة الفتوق الأربية-معالجة آفات الفتوق والثدي الجراحية
''',
        isExpanded: false.obs,
        image: mPost8Img,
        isBgPink: false,
      ),
      MajorModel(
        title: 'عيادة العلاج الفيزيائي',
        body: '''
معالجة آلام العمود الفقري وتشوهاته الجنف - الانقراص - الانزلاق -فتق النواة اللبية (الديسك)*
-معالجة الالام المفصلية (تنكسات المفاصل -تأهيل مابعد العمليات ركبة_ورك
معالجة آلالام العضلات وتقويتها - اعادة تأهيل مرضى الكسور - اعادة تأهيل مرضى الجلطات والأذيات الدماغية (الشلل النصفي -شقي -شلل الضفيرة العضدية -شلل بل)
مساج علاجي

''',
        isExpanded: false.obs,
        image: mPost7Img,
        isBgPink: false,
      ),
      MajorModel(
        title: 'حقن الفيلر ',
        body: '''
الفيلر هو إجراء غير جراحي لا يحتاج  لتخدير، وتستغرق عملية الفيلر ما بين ربع ساعة إلى نصف ساعة لملئ الفراغات تحت الجلد التي تسببها التجاعيد وعلامات التقدم في السن، مما يعيد للوجه مظهر شبابي ممتلئ و جميل. يستخدم في تقنية الفيلر عدة مواد منها الطبيعي كالخلايا الدهنية أو الكولاجين ومنها الصناعية كحمض الهيالورنيك أو البولمير الصناعي
''',
        isExpanded: false.obs,
        image: bPost9Img,
        isBgPink: true,
      ),
      MajorModel(
        title:
            'حقن الميزو ( تصبغات..نضارة .. توريد الشفايف .. فيلر .. تذويب ..)',
        body: '''
-	تحتوي مادة حقن الميزوثيرابي على فيتامينات ومركّبات طبيعية، وأحماض أمينية تساعد في تجديد الجلد وإعادة نضارته، وأكثر ما يميّز تقنية الميزوثيرابي عدم تسببها في أية آثار جانبيّة، ما عدا المضاعفات المؤقتة بعد العلاج مباشرةً والتي تدوم لمدّة لا تزيد عن 48 ساعة فقط، إذ يعتمد مبدأ العلاج التجميليّ بتقنية الميزوثيرابي على الحقن الموضعي، وتستخدم هذه التقنية في حلّ مشاكل الجلد 
المختلفة، للنضارة بشرة الوجه وعلاج مشاكل تساقط الشعر، وإذابة الدهون
''',
        isExpanded: false.obs,
        image: bPost8Img,
        isBgPink: true,
      ),
      MajorModel(
        title: 'لعلاج البهاق والصدفيه والثعلبة والاكزيما',
        body: '''
-جهاز الإكزايمر ليزر excimer laser
البهاق هو مرض جلدي يحدث بسبب فقدان لون الجلد الطبيعي وظهور بقع بيضاء اللون يمكن أن تؤثر في الجلد أو في أي جزء من الجسم، وقد يؤثر أيضًا في الشعر وداخل الفم. الصدفية هي تهيج مزمن يصيب الجلد؛ حيث تتميز بوجود بقع حمراء بارزة وقشور فضية، وتراوح أعراضها ما بين البسيطة إلى الشديدة. الثعلبة مرض مناعي غير معدٍ، يسبب تساقط الشعر في منطقة واحدة، أو مناطق متعددة من فروة الرأس، أو الوجه، أو الجسم، دون أن يخلف ندبات أو علامات. الاكزيما هي حالة مزمنة من جفاف الجلد تسبب حكة واحمرارًا للبشرة
''',
        isExpanded: false.obs,
        image: bPost7Img,
        isBgPink: true,
      ),
      MajorModel(
        title: ' عيادة التغذية ',
        body: '''
أنظمة غذائية للبدانة والنحافة _تغذية الرياضيين _مراقبة الأمراض المزمنة (ضغط -سكري-شحوم-كلى-كولسترول-أمراض غدية)
تغذية الحوامل والمرضع والاطفال ومراقبة نموهم
متابعة غذائية بعد العمليات الجراحية ويتم التنظيم والتعاون بين عيادة التغذية وكل العيادات الاخرى كحلقة كاملة متكاملة .

''',
        isExpanded: false.obs,
        image: mPost12Img,
        isBgPink: false,
      ),
      MajorModel(
        title: 'عيادة الأشعة ( ايكو _ أشعة بسيطة _ بانوراما )',
        body: '''
تصوير اشعة بسيطة عالية الدقة ( العمود الفقري. جمجمة. صدر. بطن. حوض. اطراف علوية وسفلية ) ايكو رباعي لتصوير البطن والحوض والعنق ومراقبة الحمل ببروب رباعي الابعاد.
''',
        isExpanded: false.obs,
        image: mPost11Img,
        isBgPink: false,
      ),
      MajorModel(
        title: 'عيادة النسائية ',
        body: '''
معالجة أمراض العقم - متابعة الامراض النسائية -توليد  
ايكو رباعي الابعاد

''',
        isExpanded: false.obs,
        image: mPost10Img,
        isBgPink: false,
      ),
      MajorModel(
        title: 'عيادة  العظمية ',
        body: '''
معالجة الكسور ..تشوهات ولادية . آلام الظهر والمفاصل . تبديل مفصل ..تطويل اطراف.

''',
        isExpanded: false.obs,
        image: mPost13Img,
        isBgPink: false,
      ),
      MajorModel(
        title: 'عيادة الأطفال ',
        body: '''
متابعة فشل واضطرابات النمو عند الطفل - متابعة الامراض التحسسية والصدرية عند الطفل – لقاحات
''',
        isExpanded: false.obs,
        image: mPost14Img,
        isBgPink: false,
      ),
      MajorModel(
        title: 'عيادة الجراحة العصبية ',
        body: '''
معالجة وجراحة جميع امراض واورام الجهاز العصبي العظمي من فتوق نواة لبية واورام بالقناة الشوكية واورام الدماغ ومعالجة انواع الشلل الجراحي .
''',
        isExpanded: false.obs,
        image: mPost15Img,
        isBgPink: false,
      ),
      MajorModel(
        title: 'طب عام اسعاف',
        body: '''
استقبال الحالات الاسعافية ومتابعتها -العناية بالحالات الصدرية والأمراض الداخلية ..تقطيب جرح ..قياس ومتابعة الضغط .. تحليل السكر العادي ..
تسمم / تحسس

''',
        isExpanded: false.obs,
        image: mPost18Img,
        isBgPink: false,
      ),
      MajorModel(
        title: 'عيادة جراحة الأوعية الدموية ',
        body: '''
ايكو دوبللر للأوعية - علاج القدم السكري ومتابعة الجروح المزمنة والقرح الوريدية- علاج القصور المزمن للشرايين الطرفية-علاج دواللي الساقين-علاج جلطات الأوردة العميقة-علاج تصلب الشرايين
''',
        isExpanded: false.obs,
        image: mPost17Img,
        isBgPink: false,
      ),
      MajorModel(
        title: 'عيادة الامراض الداخلية العصبية:',
        body: '''
تشخيص ومعالجة الامراض العصبية
(الصداع-الصرع-الشقيقة-الفالج-
اضطرابات النوم-اضطرابات المزاج-الديسك-آلام الظهر والرقبة)

''',
        isExpanded: false.obs,
        image: mPost16Img,
        isBgPink: false,
      ),
      MajorModel(
        title: 'عيادة الامراض النفسية:',
        body: '''
يتعرَّض الكثير من الأشخاص لمشكلات تَتعلق بالصحة العقلية من وقت لآخر. ولكن يصبح القلق المتعلق بالصحة العقلية مرضًا نفسيًّا عندما تسبب العلامات والأعراض المستمرة إجهادًا متكررًا تؤثر على قدرتك على العمل.
يمكن أن يجعلك المرض النفسي بائسًا، ويمكن أن يسبب مشكلات في حياتك اليومية، مثل المدرسة أو العمل، أو في علاقاتك بالأشخاص الآخرين. في معظم الحالات، يمكن التعامل مع الأعراض من خلال مجموعة من الأدوية والعلاج بالكلام)العلاج النفسي).
في مركز نا نقدم   لك كل ما تحتاجه لدعم صحتك النفسية وان تكون بخير وسعيد دوماً

''',
        isExpanded: false.obs,
        image: mPost19Img,
        isBgPink: false,
      ),
      MajorModel(
        title: 'عيادة أمراض الكلى :',
        body: '''
توفر عيادة امراض الكلى الإمكانات التي تساعدها على تقديم رعاية متكاملة لمرضى الكلى، لما يمتلكه من كفاءات طبية عالية التأهيل ، وممن لديهم خبرة كبيرة في تشخيص وعلاج الالتهابات الكلوية الحادة والمزمنة ، ومتابعة وعلاج مرضى الفشل الكلوي وحصوات الكلى وكذلك تحضير ومتابعة مرضى زراعة الكلى ، كما أن العيادة تقدم رعاية فائقة للمرضى الذين يعانون من الأمراض المصاحبة مثل السكري وارتفاع ضغط الدم . وأطباؤنا على اطلاع دائم بآخر المستجدات الطبية وأحدث الدراسات والأبحاث العلمية لمرضى الكلى.
''',
        isExpanded: false.obs,
        image: mPost20Img,
        isBgPink: false,
      ),
    ];
  }
}
